# Parameters
nc: 5 # number of classes
scales:
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0 H/2
  - [-1, 1, Conv, [128, 3, 2]] # 1 H/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3 H/8
  - [-1, 6, C2f, [256, True]]  # 4 save
  - [-1, 1, Conv, [512, 3, 2]] # 5 H/16
  - [-1, 6, C2f, [512, True]]  # 6 save
  - [-1, 1, Conv, [1024, 3, 2]] # 7 H/32
  - [-1, 1, SST, [1024, True]]  # 2
  - [-1, 1, SPPF, [1024, 5]] # 9  # save

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12 save

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15 save

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 18 save

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 21 save

  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)
